<?php

/**
 * Описание 
 */

return $lang = [
    'message' => [
        'no_controller' => 'Контроллер не знайдений: ',
        'no_action'     => 'Такого методу не існує: ',
        'empty_sql'     => 'SQL питання не може бути пустим',
        'error'         => 'Сторінка не існує, <br><br>  або у вас відсутні права доступу до неї!',
        'hide_login'    => 'Введіть логін, e-mail або номер телефону',
        'hide_pass'     => 'Мінімум 6 символів'
    ],
    'text' => [
        'greeting' =>
            '<h2>Ласкаво просимо на планету Mira!</h2>

            <p>Ти потрапив сюди разом з іншими випадковими подорожніми. На вас лежить важлива місія: процвітання і благополуччя планети.</p>

            <p>Mira існувала мільйони років. Люди заселили її лише недавно. Можливо, саме ти зіграєш вирішальну роль у долі людства планети Mira.</p>

            <p>Процвітання цивілізації!</p>'
    ],
    'button' => [
        'enter'        => 'Увійти',
        'forgot_pass'  => 'Забув пароль?',
        'registration' => 'Реєстрація',
        'articles'     => 'Статті',
        'issue'           => 'Питання',
        'escape'       => 'Вихід',
        'add_article'  => 'Добавити нову статью',
        'edit_article'  => 'Редагувати статью',
        'delete_article'  => 'Видалити статтю',
        'read_more' => 'читати далі...',
        'add_issue'       => 'добавити питання',
    ],
    'error' => [
        'field' => 'Поле ',
        'required' => ' не повинно бути пустим.',
        'string' => ' повинно бути стрічкою.',
        'number' => ' повинно бути числом',
        'min' => ' не повинно мати менше символов ніж',
        'max' => ' не поаинно мати більше символов ніж',
        'regV'       => ': не відповідає паттерну ',
        'user_exist' => 'Такий користувач існує!',
        'login' => ': використано заборонені символи.<br>  Тільки латинскі букви, цифри, "-" і "_".',
        'verify'=> 'Помилка авторизації!',
    ],
    'label' => [
        'login' => 'username',
        'pass' => 'password',
        'title_article' => 'Назва статті:',
        'text_article' => 'Текст статті:',
    ],
    'load' => 'До будь-якого url-у через "/" в будь-якому місці, до масиву $ _GET <br> можна дописати 2 букви мови: ru, ua або en - <br> відбудеться глобальна зміна мови.',

];
